// Получает полное относительное имя файла PUG в каталоге шаблонов PUG
Функция ПолучитьПолноеИмяФайлаpug(Страница) Экспорт 
	
	Возврат ПолучитьПолноеИмяФайлаPUGРекурсивно(Страница, "");	
	
КонецФункции

Функция ПолучитьПолноеИмяФайлаPUGРекурсивно(Страница, Путь)
	
	НовыйПуть = "";
	НовыйПуть = Путь + "\" + Страница.Наименование;
	Если ЗначениеЗаполнено(Страница.Родитель) Тогда
		Возврат ПолучитьПолноеИмяФайлаPUGРекурсивно(Страница.Родитель, НовыйПуть);
	Иначе
		Возврат НовыйПуть;
	КонецЕсли;	
	
КонецФункции

// Получает в массив все алгоритмы заполнения для страницы
Функция ПолучитьАлгоритмыЗаполнения(Страница) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВебСайт_АлгоритмыПолученияДанныхСтраницы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВебСайт_АлгоритмыПолученияДанных.Страницы КАК ВебСайт_АлгоритмыПолученияДанныхСтраницы
	               |ГДЕ
	               |	ВебСайт_АлгоритмыПолученияДанныхСтраницы.Страница = &Страница
	               |	И ВебСайт_АлгоритмыПолученияДанныхСтраницы.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Страница",Страница );
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции 
