// Выполняет алгоритм страницы личного кабинета.
//
// Параметры:
//	
//
Процедура ВыполнитьАлгоритм(Тело, Переменные, Запрос, Ответ, Знач ОтносительныйURL, ОтносительныйURLПеренаправления, Знач ИмяФайла, Знач Путь, Знач Алгоритм, Знач ЭтоPOST, Знач ПараметрыЗапроса, Знач АвторизованныйПользователь) Экспорт
	
	Если ПустаяСтрока(Алгоритм) ТОгда
		Возврат;
	КонецЕсли;

	Попытка
		Выполнить(Алгоритм);	
	Исключение
		Тело = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

Процедура ВставитьВТелоШаблоны(Тело, Переменные, Запрос, Ответ, ОтносительныйURL, ОтносительныйURLПеренаправления, ИмяФайла, Путь, АлгоритмОбработки, ЭтоPOST, СтруктураПараметров,АвторизованныйПользователь) Экспорт
	
	// Замена конструкций вида <!---include(...)--->
	ОткрытыйТег = "<!---include(";
	ЗакрытыйТег = ")--->";
	Индекс = СтрНайти(НРег(Тело), ОткрытыйТег);
	Пока Индекс > 0 Цикл
		
		// Находим )--->
		Индекс2 = СтрНайти(НРег(Тело), ЗакрытыйТег);
		Если Индекс2 = 0 Тогда
			Прервать;
		КонецЕсли;
		Стр = Сред(Тело, Индекс + СтрДлина(ОткрытыйТег), Индекс2 - Индекс - СтрДлина(ОткрытыйТег));
		Если СтрНайти(Стр, "/") = 0 Тогда
			Стр = "/" + Стр;
		КонецЕсли;
		Стр = СтрЗаменить(Стр, """", "");
		Стр = СтрЗаменить(Стр, "'", "");
		ИмяФайлаТега = Сред(Стр, СтрНайти(Стр, "/", НаправлениеПоиска.СКонца) + 1);
		ПутьТега = Лев(Стр, СтрДлина(Стр) - СтрДлина(ИмяФайлаТега));
		
		СтруктураСтраницыТега = ВебСайт_HTTPСервисы.ПолучитьСтруктуруСтраницыОтносительногоURL(ПутьТега, ИмяФайлаТега);
		Если СтруктураСтраницыТега <> Неопределено Тогда
			ДанныеТега = СтруктураСтраницыТега.ХранилищеФайла.Получить(); 
			ТелоТега = ВебСайт_HTTPСервисы.ПолучитьТекстИзДвоичныхДанных(ДанныеТега);
			ВебСайт_Шаблонизатор.ВыполнитьАлгоритм(ТелоТега, Переменные, Запрос, Ответ, ОтносительныйURL, ОтносительныйURLПеренаправления, ИмяФайла, Путь, СтруктураСтраницыТега.АлгоритмОбработки, ЭтоPOST, СтруктураПараметров, АвторизованныйПользователь); 
		Иначе
			ТелоТега = СтрШаблон(НСтр("ru = '<font color=""red"">%1 ""%2""</font>'"), НСтр("ru = 'Не найден файл'"),Стр);
		КонецЕсли;
		
		Тело = Лев(Тело, Индекс - 1) + ТелоТега + Сред(Тело, Индекс2 + СтрДлина(ЗакрытыйТег));
		
		Индекс = СтрНайти(НРег(Тело), ОткрытыйТег, , Индекс + 1);
	КонецЦикла;

	
КонецПроцедуры 

Процедура ВставитьВТелоПараметры(Тело, Переменные, Запрос, Ответ, ОтносительныйURL, ОтносительныйURLПеренаправления, ИмяФайла, Путь, АлгоритмОбработки, ЭтоPOST, СтруктураПараметров, АвторизованныйПользователь) Экспорт
	
	// Выполнить алгоритм
	ВебСайт_Шаблонизатор.ВыполнитьАлгоритм(Тело, Переменные, Запрос, Ответ, ОтносительныйURL, ОтносительныйURLПеренаправления, ИмяФайла, Путь, АлгоритмОбработки, ЭтоPOST, СтруктураПараметров, АвторизованныйПользователь); 
	
	// Подставим переменные.
	ОткрытыйТег = "<!---";
	ЗакрытыйТег = "--->";
	Индекс = СтрНайти(НРег(Тело), ОткрытыйТег);
	Пока Индекс > 0 Цикл
		
		// Находим --->
		
		Индекс2 = СтрНайти(НРег(Тело), ЗакрытыйТег);
		Если Индекс2 = 0 Тогда
			Прервать;
		КонецЕсли;
		Стр = Сред(Тело, Индекс + СтрДлина(ОткрытыйТег), Индекс2 - Индекс - СтрДлина(ОткрытыйТег));
		Стр = СокрЛП(Стр);
		Тег = "";
		// Есть в переменных?
		Если НЕ Переменные.Свойство(Стр, Тег) Тогда
			Тег = СтрШаблон(НСтр("ru = '<font color=""red"">Не найдена переменная ""%1""</font>'"), Стр);				
		КонецЕсли;			
		Тело = Лев(Тело, Индекс - 1) + Тег + Сред(Тело, Индекс2 + СтрДлина(ЗакрытыйТег));
		Индекс = СтрНайти(НРег(Тело), ОткрытыйТег, НаправлениеПоиска.СНачала, Индекс+1);
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьТаблицуПараметов(Знач Тело) Экспорт
	
	ТаблицаПараметров = Новый ТаблицаЗначений;
	ТаблицаПараметров.Колонки.Добавить("Параметр",Новый ОписаниеТипов("Строка"));
	
	ОткрытыйТег = "<!---";
	ЗакрытыйТег = "--->";
	Индекс = СтрНайти(НРег(Тело), ОткрытыйТег);
	Пока Индекс > 0 Цикл
		
		// Находим --->
		Индекс2 = СтрНайти(НРег(Тело), ЗакрытыйТег);
		Если Индекс2 = 0 Тогда
			Прервать;
		КонецЕсли;
		Стр = Сред(Тело, Индекс + СтрДлина(ОткрытыйТег), Индекс2 - Индекс - СтрДлина(ОткрытыйТег));
		Стр = СокрЛП(Стр);
		Тег = "";		
		Тело = Лев(Тело, Индекс - 1) + Тег + Сред(Тело, Индекс2 + СтрДлина(ЗакрытыйТег));
		Индекс = СтрНайти(НРег(Тело), ОткрытыйТег, НаправлениеПоиска.СНачала, Индекс+1);
		Строка = ТаблицаПараметров.Добавить();
		Строка.Параметр = Стр;
	КонецЦикла;

	Возврат ТаблицаПараметров;
	
КонецФункции