Функция ВернутьHTMLПоОтносительнойСсылке(Знач Путь, Знач ИмяФайла) Экспорт
	
	Если СтрДлина(Путь) > 1 тогда
		Путь = Сред(Путь,2);
	Иначе
		Путь = "";
	КонецЕсли;
	
	ОтносительнаяСсылка = Путь+ИмяФайла;
		
	МакетСвязей = ПолучитьМакет("ШаблоныСтраниц");
	ОбластьЯчеекСсылкаШаблон = МакетСвязей.Область("C1");
	ОбластьНачалаПоиска = МакетСвязей.Область(2,1,2,1);
	Ячейка = МакетСвязей.НайтиТекст(ОтносительнаяСсылка,ОбластьНачалаПоиска,ОбластьЯчеекСсылкаШаблон);
	Если Ячейка = неопределено тогда
		Возврат неопределено;	
	КонецЕсли;
	
	ОбластьТипФайла				 = МакетСвязей.ПолучитьОбласть("C2");
	ОбластьАлгоритмОбработки	 = МакетСвязей.ПолучитьОбласть("C3");
	ОбластьХранилищеФайла		 = МакетСвязей.ПолучитьОбласть("C4");
	ОбластьСтраницаАвторизации	 = МакетСвязей.ПолучитьОбласть("C5");
	ОбластьСтраницаДоступноБезАвторизации	 = МакетСвязей.ПолучитьОбласть("C6");
	ОбластьСтраница404			 = МакетСвязей.ПолучитьОбласть("C7");
	ОбластьСтраницаОсновная		 = МакетСвязей.ПолучитьОбласть("C8");
	
	ТипФайла 			= ОбластьТипФайла.Область(Ячейка.Верх,1,Ячейка.Верх,1).Текст;
	АлгоритмОбработки 	= ОбластьАлгоритмОбработки.Область(Ячейка.Верх,1,Ячейка.Верх,1).Текст;
	ХранилищеФайла 		= ОбластьХранилищеФайла.Область(Ячейка.Верх,1,Ячейка.Верх,1).Текст;
	ХранилищеФайла 		= XMLЗначение(Тип("ХранилищеЗначения"),ХранилищеФайла);
	СтраницаАвторизации = ?(ОбластьСтраницаАвторизации.Область(Ячейка.Верх,1,Ячейка.Верх,1).Текст = "1", Истина,Ложь);
	СтраницаДоступноБезАвторизации = ?(ОбластьСтраницаДоступноБезАвторизации.Область(Ячейка.Верх,1,Ячейка.Верх,1).Текст = "1", Истина,Ложь);
	Страница404		    = ?(ОбластьСтраница404.Область(Ячейка.Верх,1,Ячейка.Верх,1).Текст = "1", Истина,Ложь);
	СтраницаОсновная	= ?(ОбластьСтраницаОсновная.Область(Ячейка.Верх,1,Ячейка.Верх,1).Текст = "1", Истина,Ложь);
	
	СтруктураСтраницы = Новый Структура("ТипФайла,АлгоритмОбработки,ХранилищеФайла,СтраницаАвторизации,СтраницаДоступноБезАвторизации,Страница404,СтраницаОсновная"
										,ТипФайла,АлгоритмОбработки,ХранилищеФайла,СтраницаАвторизации,СтраницаДоступноБезАвторизации,Страница404,СтраницаОсновная); 	
	Возврат СтруктураСтраницы;
	
КонецФункции

Функция ПолучитьОтносительнуюСсылкуСтраницы404() Экспорт
	
	МакетСвязей = ПолучитьМакет("ШаблоныСтраниц");
	ОбластьСтраница404	= МакетСвязей.Область("C7");
	ОбластьНачалаПоиска = МакетСвязей.Область(2,7,2,7);
	Ячейка = МакетСвязей.НайтиТекст("1",ОбластьНачалаПоиска,ОбластьСтраница404);
	
	Если Ячейка = неопределено тогда
		Возврат "";	
	КонецЕсли;
	
	ОбластьОтносительнаяСсылка = МакетСвязей.ПолучитьОбласть("C1");
	
	Возврат ОбластьОтносительнаяСсылка.Область(Ячейка.Верх,1,Ячейка.Верх,1).Текст;
	
КонецФункции

Функция ПолучитьОтносительнуюСсылкуОсновнойСтраницы() Экспорт
	
	МакетСвязей = ПолучитьМакет("ШаблоныСтраниц");
	ОбластьОсновнойСтраницы	= МакетСвязей.Область("C8");
	ОбластьНачалаПоиска = МакетСвязей.Область(2,8,2,8);
	Ячейка = МакетСвязей.НайтиТекст("1",ОбластьНачалаПоиска,ОбластьОсновнойСтраницы);
	
	Если Ячейка = неопределено тогда
		Возврат "";	
	КонецЕсли;
	
	ОбластьОтносительнаяСсылка = МакетСвязей.ПолучитьОбласть("C1");
	
	Возврат ОбластьОтносительнаяСсылка.Область(Ячейка.Верх,1,Ячейка.Верх,1).Текст;
	
КонецФункции

Функция ПолучитьОтносительнуюСсылкуСтраницыАвторизации() Экспорт
	
	МакетСвязей = ПолучитьМакет("ШаблоныСтраниц");
	ОбластьСтраницаАвторизации	= МакетСвязей.Область("C5");
	ОбластьНачалаПоиска = МакетСвязей.Область(2,5,2,5);
	Ячейка = МакетСвязей.НайтиТекст("1",ОбластьНачалаПоиска,ОбластьСтраницаАвторизации);
	
	Если Ячейка = неопределено тогда
		Возврат "";	
	КонецЕсли;
	
	ОбластьОтносительнаяСсылка = МакетСвязей.ПолучитьОбласть("C1");
	
	Возврат ОбластьОтносительнаяСсылка.Область(Ячейка.Верх,1,Ячейка.Верх,1).Текст;
	
КонецФункции
